In [41]:
#import libraries
!pip install kaggle
import kaggle

Requirement already satisfied: kaggle in c:\users\user\anaconda3\lib\site-packages (1.6.17)
Requirement already satisfied: six>=1.10 in c:\users\user\anaconda3\lib\site-packages (from kaggle) (1.16.0)
Requirement already satisfied: certifi>=2023.7.22 in c:\users\user\anaconda3\lib\site-packages (from kaggle) (2024.8.30)
Requirement already satisfied: python-dateutil in c:\users\user\anaconda3\lib\site-packages (from kaggle) (2.9.0.post0)
Requirement already satisfied: requests in c:\users\user\anaconda3\lib\site-packages (from kaggle) (2.32.2)
Requirement already satisfied: tqdm in c:\users\user\anaconda3\lib\site-packages (from kaggle) (4.66.4)
Requirement already satisfied: python-slugify in c:\users\user\anaconda3\lib\site-packages (from kaggle) (5.0.2)
Requirement already satisfied: urllib3 in c:\users\user\anaconda3\lib\site-packages (from kaggle) (2.2.2)
Requirement already satisfied: bleach in c:\users\user\anaconda3\lib\site-packages (from kaggle) (4.1.0)
Requirement already satisfied: packaging in c:\users\user\anaconda3\lib\site-packages (from bleach->kaggle) (23.2)
Requirement already satisfied: webencodings in c:\users\user\anaconda3\lib\site-packages (from bleach->kaggle) (0.5.1)
Requirement already satisfied: text-unidecode>=1.3 in c:\users\user\anaconda3\lib\site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests->kaggle) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests->kaggle) (3.7)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from tqdm->kaggle) (0.4.6)

In [51]:
#read data from the file and handle null values
import pandas as pd
df = pd.read_csv('orders.csv', na_values=['Not Available', 'unknown'])
df['Ship Mode'].unique()

array(['Second Class', 'Standard Class', nan, 'First Class', 'Same Day'],
      dtype=object)

In [61]:
#rename column names, make them lower case and replace space with underscore
df.columns=df.columns.str.lower()
df.columns=df.columns.str.replace(' ','_')
df.head(5)

,order_id,order_date,ship_mode,segment,country,city,state,postal_code,region,category,sub_category,product_id,cost_price,list_price,quantity,discount_percent
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,FUR-CH-10000454,600,730,3,3
2,3,2023-01-10,Second Class,Corporate,United States,Los Angeles,California,90036,West,Office Supplies,Labels,OFF-LA-10000240,10,10,2,5
3,4,2022-06-18,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,Tables,FUR-TA-10000577,780,960,5,2
4,5,2022-07-13,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Office Supplies,Storage,OFF-ST-10000760,20,20,2,5

In [73]:
#derive new columns discount, sale price and profit
df['discount']=df['list_price']*df['discount_percent']*.01
df['sale_price']=df['list_price']-df['discount']
df['profit']=df['sale_price']-df['cost_price']
df

,order_id,order_date,ship_mode,segment,country,city,state,postal_code,region,category,sub_category,product_id,cost_price,list_price,quantity,discount_percent,discount,sale_price,profit
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2,5.2,254.8,14.8
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,FUR-CH-10000454,600,730,3,3,21.9,708.1,108.1
2,3,2023-01-10,Second Class,Corporate,United States,Los Angeles,California,90036,West,Office Supplies,Labels,OFF-LA-10000240,10,10,2,5,0.5,9.5,-0.5
3,4,2022-06-18,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,Tables,FUR-TA-10000577,780,960,5,2,19.2,940.8,160.8
4,5,2022-07-13,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Office Supplies,Storage,OFF-ST-10000760,20,20,2,5,1.0,19.0,-1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,2023-02-18,Second Class,Consumer,United States,Miami,Florida,33180,South,Furniture,Furnishings,FUR-FU-10001889,30,30,3,4,1.2,28.8,-1.2
9990,9991,2023-03-17,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Furniture,Furnishings,FUR-FU-10000747,70,90,2,4,3.6,86.4,16.4
9991,9992,2022-08-07,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Technology,Phones,TEC-PH-10003645,220,260,2,2,5.2,254.8,34.8
9992,9993,2022-11-19,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Office Supplies,Paper,OFF-PA-10004041,30,30,4,3,0.9,29.1,-0.9
9993,9994,2022-07-17,Second Class,Consumer,United States,Westminster,California,92683,West,Office Supplies,Appliances,OFF-AP-10002684,210,240,2,3,7.2,232.8,22.8

In [77]:
#convert order date from object data type to datetime
df['order_date']=pd.to_datetime(df['order_date'],format="%Y-%m-%d")

In [85]:
#drop cost price, list price and discount percent columns
df.drop(columns=['cost_price','list_price','discount_percent'],inplace=True)

In [113]:
#load the data into sql server 
!pip install sqlalchemy 
!pip install psycopg2-binary
import sqlalchemy
from sqlalchemy import create_engine
db_connection_url = 'postgresql+psycopg2://postgres:7725925@localhost:5432/sql_py_proj'
engine = create_engine(db_connection_url)
data = {'column1': [1, 2, 3], 'column2': ['a', 'b', 'c']}

# Load DataFrame to SQL
df.to_sql(
    'df_orders',  # Name of the table in your database
    engine,  # The engine you created
    if_exists='append',  # Options: 'fail', 'replace', or 'append'
    index=False  # Set to True if you want DataFrame indices as a column in SQL
)

Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: psycopg2-binary in c:\users\user\anaconda3\lib\site-packages (2.9.10)

994

In [129]:
#find top 10 highest revenue generating products
query = """
SELECT
    product_id,
    sum(sale_price) AS sales
FROM
    df_orders
GROUP BY
    product_id
ORDER BY
    sales DESC
LIMIT 10;
"""
df_new = pd.read_sql(query,engine)
df_new.head(10)

        product_id    sales
0  TEC-CO-10004722  59514.0
1  OFF-BI-10003527  26525.3
2  TEC-MA-10002412  21734.4
3  FUR-CH-10002024  21096.2
4  OFF-BI-10001359  19090.2
5  OFF-BI-10000545  18249.0
6  TEC-CO-10001449  18151.2
7  TEC-MA-10001127  17906.4
8  OFF-BI-10004995  17354.8
9  OFF-SU-10000151  16325.8

In [133]:
#find top 5 highest selling products in each region
query = """
WITH each_region AS(
    SELECT
        product_id,
        region,
        sale_price,
        ROW_NUMBER() OVER (PARTITION BY region ORDER BY sale_price DESC) AS rank
    FROM
        df_orders
)
SELECT
    product_id,
    region,
    sale_price
FROM
    each_region
WHERE
    rank <= 5
ORDER BY 
    region, rank;
"""
df_new = pd.read_sql(query,engine)
df_new.head(20)

         product_id   region  sale_price
0   TEC-CO-10004722  Central     16975.0
1   OFF-BI-10000545  Central      9395.5
2   OFF-BI-10001120  Central      9261.0
3   TEC-MA-10000822  Central      7833.6
4   OFF-BI-10004995  Central      5222.4
5   TEC-CO-10004722     East     10976.0
6   TEC-CO-10004722     East      9975.0
7   TEC-MA-10001047     East      8827.0
8   TEC-CO-10004722     East      8148.0
9   TEC-MA-10001127     East      6790.0
10  TEC-MA-10002412    South     21734.4
11  TEC-MA-10001127    South      8575.0
12  TEC-MA-10004125    South      7840.0
13  OFF-BI-10003527    South      6159.5
14  TEC-PH-10001459    South      4151.5
15  TEC-CO-10004722     West     13440.0
16  OFF-SU-10000151     West      7780.5
17  OFF-BI-10003527     West      4826.0
18  OFF-SU-10000151     West      4811.8
19  TEC-MA-10000418     West      4704.0

In [137]:
#find month over month growth comparison for 2022 and 2023 sales eg : jan 2022 vs jan 2023
query = """
WITH growth_comparison AS (
    SELECT
        EXTRACT(YEAR FROM order_date) AS order_year,
        EXTRACT(MONTH FROM order_date) AS order_month,
        SUM(sale_price) AS sales
    FROM
        df_orders
    GROUP BY
       EXTRACT(YEAR FROM order_date),
       EXTRACT(MONTH FROM order_date)
)
SELECT 
    order_month
   ,SUM(CASE WHEN order_year=2022 THEN sales ELSE 0 END) AS sales_2022
   ,SUM(CASE WHEN order_year=2023 THEN sales ELSE 0 END) AS sales_2023
FROM
    growth_comparison
GROUP BY
    order_month
ORDER BY
    order_month;
"""
df_new = pd.read_sql(query,engine)
df_new.head(12)

    order_month  sales_2022  sales_2023
0           1.0     94712.5     88632.6
1           2.0     90091.0    128124.2
2           3.0     80106.0     82512.3
3           4.0     95451.6    111568.6
4           5.0     79448.3     86447.9
5           6.0     94170.5     68976.5
6           7.0     78652.2     90563.8
7           8.0    104808.0     87733.6
8           9.0     79142.2     76658.6
9          10.0    118912.7    121061.5
10         11.0     84225.3     75432.8
11         12.0     95869.9    102556.1

In [153]:
#for each category which month had highest sales
query = """
WITH monthly_sales AS (
    SELECT
        category,
        TO_CHAR(order_date, 'YYYYMM') AS order_year_month,
        SUM(sale_price) AS sales
    FROM
        df_orders
    GROUP BY
        category,
        TO_CHAR(order_date, 'YYYYMM')
)
SELECT
    category,
    order_year_month,
    sales
FROM (
    SELECT
        *,
        ROW_NUMBER() OVER (PARTITION BY category ORDER BY sales DESC) AS rank
    FROM
        monthly_sales
) AS a
WHERE
    rank = 1;
"""
df_new = pd.read_sql(query,engine)
df_new.head()

          category order_year_month    sales
0        Furniture           202210  42888.9
1  Office Supplies           202302  44118.5
2       Technology           202310  53000.1

In [193]:
#which sub category had highest growth by profit in 2023 compare to 2022
query = """
WITH growth_comparison AS (
    SELECT
        sub_category,
        EXTRACT(YEAR FROM order_date) AS order_year,
        SUM(sale_price) AS sales
    FROM
        df_orders
    GROUP BY
       sub_category,
       EXTRACT(YEAR FROM order_date)
)
, sub_category_growth AS(
SELECT 
    sub_category
   ,SUM(CASE WHEN order_year=2022 THEN sales ELSE 0 END) AS sales_2022
   ,SUM(CASE WHEN order_year=2023 THEN sales ELSE 0 END) AS sales_2023
FROM
    growth_comparison
GROUP BY
    sub_category
)
SELECT 
    sub_category,
    sales_2022,
    sales_2023,
    (sales_2023-sales_2022)*100/sales_2022 AS growth_percent
FROM
    sub_category_growth
ORDER BY
    growth_percent  DESC
"""
df_new = pd.read_sql(query,engine)
df_new.head()

  sub_category  sales_2022  sales_2023  growth_percent
0     Supplies     16140.7     28917.4       79.158277
1     Machines     73723.2    109178.5       48.092459
2      Binders     87675.5    108363.1       23.595645
3      Storage    102907.4    113000.6        9.808041
4       Chairs    151395.3    165429.8        9.270103